openfoam/shape_optimization/clean/baseCase/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

patches     (walls);

magUInf     26;
lRef        1;
Aref        1;

liftDir     (0 1 0);
dragDir     (1 0 0);

CofR        (0 0 0);
pitchAxis   (0 0 1);

#includeEtc "caseDicts/postProcessing/forces/forceCoeffsIncompressible.cfg"

// ************************************************************************* //
